app/Controllers/BarangController.php

SELECT *
FROM `barang`
---
    public function barang_read()
    {
        $barangModel = new ModelBarang();
        $data = [
            'title' => "Data Barang",
            'data_barang' => $barangModel->findAll(),
        ];

SELECT *
FROM `barang`
WHERE `barang`.`id` = '12'
---
            }
        }
        $data['title'] = "Data Barang";
        $data_barang = $barangModel->find($id);