app/Controllers/BarangController.php

    public function barang_read()
    {
        $barangModel = new ModelBarang();
        $data['data_barang'] = $barangModel->findAll();
---
SELECT *
FROM `barang`