app/Controllers/Dashboard.php

SELECT *
FROM `barang`
---
    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/');
        }

        $penggunaModel = new ModelPengguna();
        $karyawanModel = new ModelKaryawan();
        $barangModel = new ModelBarang();
        $suratModel = new ModelSurat();

        $data = [
            'title' => "Dashboard",
            'total_pengguna' => $penggunaModel->countTotalPengguna(),
            'total_karyawan' => $karyawanModel->countTotalKaryawan(),
            'total_barang' => $barangModel->countTotalBarang(),
            'total_surat' => $suratModel->countTotalSurat(),
            'data_barang' => array_slice($barangModel->getBarangWithKaryawan(), 0, 10),
            'data_surat' => array_slice($suratModel->getSuratWithKaryawan(), 0, 10)
        ];