app/Controllers/LoginController.php

SELECT *
FROM `pengguna`
WHERE `username` = 'resepsionis'
 LIMIT 1
---
    public function login()
    {
        $errorMessages = [];
        $data['title'] = "Login";

        if ($this->request->getMethod() == 'post') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            if (empty($username) || empty($password)) {
                $errorMessages[] = "Username dan password harus diisi.";
            } else {
                $penggunaModel = new ModelPengguna();
                $pengguna = $penggunaModel->where('username', $username)->first();