app/Controllers/PenggunaController.php

SELECT *
FROM `pengguna`
SELECT *
FROM `pengguna`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pengguna`
---
    public function pengguna_read()
    {
        $penggunaModel = new ModelPengguna();
        $data = [
            'title' => "Data Pengguna",
            'data_pengguna' => $penggunaModel->paginate(10),
            'pager' => $penggunaModel->pager,
        ];

SELECT *
FROM `pengguna`
WHERE `pengguna`.`id` = '13'
---
            }
        }

        $data_pengguna = $penggunaModel->find($id);

DELETE FROM `pengguna`
WHERE `id` IN ('7')
---
    public function pengguna_delete($id)
    {
        $data['title'] = "Data Pengguna";
        echo view("pengguna_read", ['data' => $data]);
        $penggunaModel = new ModelPengguna();
        $penggunaModel->delete($id);