app/Models/ModelKaryawan.php

    public function countTotalKaryawan()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `karyawan`