app/Models/ModelBarang.php

    public function countTotalBarang()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `barang`