app/Models/ModelBarang.php

SELECT `barang`.*, `karyawan`.`username` AS `nama_penerima`, `karyawan`.`email` AS `email_penerima`
FROM `barang`
LEFT JOIN `karyawan` ON `barang`.`id_penerima` = `karyawan`.`id`
ORDER BY `barang`.`id` DESC
---
    public function getBarangWithKaryawan()
    {
        return $this->db->table('barang')
            ->select('barang.*, karyawan.username AS nama_penerima, karyawan.email AS email_penerima')
            ->orderBy('barang.id', 'desc')
            ->join('karyawan', 'barang.id_penerima = karyawan.id', 'left')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `barang`
---
    public function countTotalBarang()
    {
        return $this->countAll();