app/Models/ModelSurat.php

    public function getSuratWithKaryawan()
    {
        return $this->db->table('surat')
            ->select('surat.*, karyawan.username AS nama_penerima, karyawan.email AS email_penerima')
            ->orderBy('surat.id', 'desc')
            ->join('karyawan', 'surat.id_penerima = karyawan.id', 'left')
            ->get()
            ->getResultArray();
---
SELECT `surat`.*, `karyawan`.`username` AS `nama_penerima`, `karyawan`.`email` AS `email_penerima`
FROM `surat`
LEFT JOIN `karyawan` ON `surat`.`id_penerima` = `karyawan`.`id`
ORDER BY `surat`.`id` DESC

    public function countTotalSurat()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `surat`