app/Models/ModelPengguna.php

SELECT COUNT(*) AS `numrows` FROM `pengguna`
---
    public function countTotalPengguna()
    {
        return $this->countAll();